In [1]:
import pandas as pd

In [23]:
list1=[1,2,3,4,5,6,7,8,9,10]
series1=pd.Series(list1)
print(series1)
tuple2=(1,2,3,4,5,6,7,8,9,10)
series2=pd.Series(tuple1)
print(series2)
set1={'1','2','3','4','5'}
series3=pd.Series(set1)
print(series3)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

TypeError: 'set' type is unordered

In [11]:
type(series1)

pandas.core.series.Series

In [14]:
#changing the series name

In [18]:
series1=pd.Series(s,index=['a','b','c','d','e'])
series1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [19]:
#how to create dataframe using list

In [20]:
import pandas as pd
data=[1,2,3,4,5]
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [22]:
#how to create dataframe using dictionary

In [27]:
dicti={"fruits":['apple','banana','grapes'],"cost":[100,200,300]}
df=pd.DataFrame(dicti)
df

   fruits  cost
0   apple   100
1  banana   200
2  grapes   300

In [ ]:
#converting series into dataframe

In [32]:
import pandas as pd

seriess=pd.Series([60,70],index=['a','b'])
df=pd.DataFrame(seriess)
df

    0
a  60
b  70

In [38]:
#creating dataframe using array

import numpy as np

arr=np.array([['mehnaz','priya'],[500000,600000]])
df=pd.DataFrame({'name':arr[0],'salary':arr[1]})
df

     name  salary
0  mehnaz  500000
1   priya  600000

In [ ]:
#creating two dataframe for merge

In [42]:
import pandas as pd

player=['player1','player2','player3']
points=[10,3,8]
title=['game1','game2','game3']
df1=pd.DataFrame({'Players':player,'points':points,'title':title})
df1

   Players  points  title
0  player1      10  game1
1  player2       3  game2
2  player3       8  game3

In [48]:
player=['player1','player4','player5']
power=['kick','punch','elbow']
title=['game1','game4','game6']
df2=pd.DataFrame({'Players':player,'Power':power,'title':title})
df2

   Players  Power  title
0  player1   kick  game1
1  player4  punch  game4
2  player5  elbow  game6

In [45]:
#inner join

In [46]:
df1.merge(df2)#by default it will perform inner merge

   Players  points  title Power  Title
0  player1      10  game1  kick  game1

In [51]:
#or
df1.merge(df2, on='title',how='inner')

  Players_x  points  title Players_y Power
0   player1      10  game1   player1  kick

In [54]:
#left
df1.merge(df2,on='Players',how='left')

   Players  points title_x Power title_y
0  player1      10   game1  kick   game1
1  player2       3   game2   NaN     NaN
2  player3       8   game3   NaN     NaN

In [55]:
#right
df1.merge(df2,on='Players',how='right')

   Players  points title_x  Power title_y
0  player1    10.0   game1   kick   game1
1  player4     NaN     NaN  punch   game4
2  player5     NaN     NaN  elbow   game6

In [ ]:
#outer

In [56]:
df1.merge(df2,on='Players',how='outer')

   Players  points title_x  Power title_y
0  player1    10.0   game1   kick   game1
1  player2     3.0   game2    NaN     NaN
2  player3     8.0   game3    NaN     NaN
3  player4     NaN     NaN  punch   game4
4  player5     NaN     NaN  elbow   game6

In [ ]:
#join ,join table based on their index

In [62]:
import pandas as pd

player=['player1','player2','player3']
points=[10,3,8]
title=['game1','game2','game3']
df3=pd.DataFrame({'Players':player,'points':points,'titles':title},index=['L1','L2','L3'])
df3

    Players  points titles
L1  player1      10  game1
L2  player2       3  game2
L3  player3       8  game3

In [66]:
player=['player1','player4','player5']
power=['kick','punch','elbow']
title=['game1','game4','game6']
df4=pd.DataFrame({'Player':player,'Power':power,'title':title},index=['L2','L3','L4'])
df4

     Player  Power  title
L2  player1   kick  game1
L3  player4  punch  game4
L4  player5  elbow  game6

In [67]:
df3.join(df4,how='inner')

    Players  points titles   Player  Power  title
L2  player2       3  game2  player1   kick  game1
L3  player3       8  game3  player4  punch  game4

In [68]:
#leftjoin
df3.join(df4,how='left')

    Players  points titles   Player  Power  title
L1  player1      10  game1      NaN    NaN    NaN
L2  player2       3  game2  player1   kick  game1
L3  player3       8  game3  player4  punch  game4

In [69]:
df3.join(df4,how='right')

    Players  points titles   Player  Power  title
L2  player2     3.0  game2  player1   kick  game1
L3  player3     8.0  game3  player4  punch  game4
L4      NaN     NaN    NaN  player5  elbow  game6

In [ ]:
#outer join

In [72]:
df3.join(df4,how='outer')

    Players  points titles   Player  Power  title
L1  player1    10.0  game1      NaN    NaN    NaN
L2  player2     3.0  game2  player1   kick  game1
L3  player3     8.0  game3  player4  punch  game4
L4      NaN     NaN    NaN  player5  elbow  game6

In [73]:
#how to concatenate two dfs in pandas

In [103]:
pd.concat([df3,df4])

    Players  points titles   Player  Power  title
L1  player1    10.0  game1      NaN    NaN    NaN
L2  player2     3.0  game2      NaN    NaN    NaN
L3  player3     8.0  game3      NaN    NaN    NaN
L2      NaN     NaN    NaN  player1   kick  game1
L3      NaN     NaN    NaN  player4  punch  game4
L4      NaN     NaN    NaN  player5  elbow  game6

In [80]:
import pandas as pd

name=['mehnaz','priya','dilal']
age=[23,24,40]
dfna=pd.DataFrame({'name':name,'age':age},index=['1','2','3'])
dfna
dfna=dfna.rename(columns={'name':'Names'})
dfna

    Names  age
1  mehnaz   23
2   priya   24
3   dilal   40

In [96]:
dfna.iloc[:1,:1]
dfna.iloc[1:2,:1]
dfna.loc[:,'Names']
dfna.loc[:,'Names':'age']

    Names  age
1  mehnaz   23
2   priya   24
3   dilal   40

In [98]:
#initializing the value
dfna['Names']='sonu'
dfna

  Names  age
1  sonu   23
2  sonu   24
3  sonu   40

In [99]:
#double the value of Names

f=lambda x:x*2
dfna['Names']=dfna['Names'].apply(f)
dfna

      Names  age
1  sonusonu   23
2  sonusonu   24
3  sonusonu   40

In [ ]:
#sort the value according the column

In [101]:
dfna.sort_values(by='age')

      Names  age
1  sonusonu   23
2  sonusonu   24
3  sonusonu   40

In [106]:
#sort the values in desecding order
dfna.sort_values(by='age',ascending=False)

      Names  age
3  sonusonu   40
2  sonusonu   24
1  sonusonu   23

In [ ]:
#Pynative

In [9]:
import pandas as pd

name=['mehnaz','priya','dilal']
age=[23,24,40]
dfna=pd.DataFrame({'name':name,'age':age},index=['1','2','3'])
dfna
dfna=dfna.rename(columns={'name':'Names'})
dfna

    Names  age
1  mehnaz   23
2   priya   24
3   dilal   40

In [14]:
value=dfna.at[1,'age']
print(value)

KeyError: 1

In [15]:
import pandas as pd

name=['mehnaz','priya','dilal']
age=[23,24,40]
dfna=pd.DataFrame({'name':name,'age':age},index=['1','2','3'])
dfna
dfna=dfna.rename(columns={'name':'Names'})
dfna

    Names  age
1  mehnaz   23
2   priya   24
3   dilal   40

In [19]:
import pandas as pd

student_dict = {'Name': ['Joe', 'Nat', 'Harry',], 'Age': [20, 21, 19], 
                'Marks': [85.10, 77.80, 91.54]}

# create DataFrame from dict
student_df = pd.DataFrame(student_dict)

value = student_df.at[2,"Age"]
print(value)

19

In [31]:
import pandas as pd

di={'Name':['mehnaz','priya','ayesha','khadija','mohammad','abubakar'],
    'age':[23,24,19,60,40,60],'gender':['f','f','f','f','m','m']}

dataframes=pd.DataFrame(di)
print(dataframes)
value1=dataframes.at[3,'gender']
print(value1)

       Name  age gender
0    mehnaz   23      f
1     priya   24      f
2    ayesha   19      f
3   khadija   60      f
4  mohammad   40      m
5  abubakar   60      m
f

In [34]:
dataframes.at[5,'age']=50

In [35]:
print(dataframes)

       Name  age gender
0    mehnaz   23      f
1     priya   24      f
2    ayesha   19      f
3   khadija   60      f
4  mohammad   50      m
5  abubakar   50      m

ValueError: iAt based indexing can only have integer indexers

In [44]:
print(dataframes)

       Name    age gender
0    mehnaz     23      f
1     priya     24      f
2    ayesha  aisha      f
3   khadija     60      f
4  mohammad     50      m
5  abubakar     50      m

In [19]:
list1=[1,2,3,4,5,6,7,8,9,10]
tuple1=(1,2,3,4,5,6,7,8,9,10)
set1={1,2,3,4,5,6,7,8,9,10}
dataset1=pd.Series('list1')
print(dataset1)

0    list1
dtype: object

In [ ]:
Create a python dictionary with three key value pairs. Keep the keys as the first names,
and the respective last names as values in the dictionary. Use the dictionary to create a
pandas series.

In [25]:
di=pd.DataFrame({'firstnames':['mehnaz','alqama','priya'],'lastname':['khan','hasnain','chaudhary']})
di

  firstnames   lastname
0     mehnaz       khan
1     alqama    hasnain
2      priya  chaudhary

In [ ]:
Create a pandas series, with the elements as numbers from 1-10. Use the index values
starting from 0-10. For the above series:
a. Convert it to a list.
b. Convert it to a dictionary.
c. Convert it to a tuple.
d. Convert it to a set

In [26]:
new=pd.Series([1,2,3,4,5,6,7,8,9,10])
new
listc=new.tolist()
type(listc)
dictc=new.to_dict()
type(dictc)
tuplec=tuple(new)
type(tuplec)
dictc=dict(new)
type(dictc)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [32]:
listc=new.tolist()
type(listc)
dictc=new.to_dict()
type(dictc)
tuplec=tuple(new)
type(tuplec)
dictc=dict(new)
type(dictc)

In [33]:
type(listc)

list

In [37]:
dictc=new.to_dict()
type(dictc)

dict

In [42]:
tuplec=tuple(new)
type(tuplec)

tuple

In [43]:
dictc=dict(new)
type(dictc)

dict

In [ ]:
Create a sample pandas series with x integer elements. Perform the following operations
on the same:
a. Print the first 5 elements of the series
b. Print the last 5 elements of the series
c. Insert an integer value 50 at the index 5.
d. Update the last element in the series with the value 100.
e. Delete the first element from the series.
Note: The index values must not be affected by the operations and should be uniform for
the series after the last operation.

In [71]:
x=pd.Series([1,2,3,4,5,6,7,8,9,10,11,12,13,14,15])
print(x[:5])
print(x[10:])
x[5]=50
x[9]=100
x.drop(1)
#print(x[14]=100)

0    1
1    2
2    3
3    4
4    5
dtype: int64
10    11
11    12
12    13
13    14
14    15
dtype: int64

0       1
2       3
3       4
4       5
5      50
6       7
7       8
8       9
9     100
10     11
11     12
12     13
13     14
14     15
dtype: int64

In [72]:
x.reset_index(drop=True)

0       1
1       2
2       3
3       4
4       5
5      50
6       7
7       8
8       9
9     100
10     11
11     12
12     13
13     14
14     15
dtype: int64

In [ ]:
For a given pandas series obtained in the 4th step. Write a sample code to find the
element 100 in the series.

In [82]:
x=pd.Series([1,2,3,4,5,6,7,8,9,10,11,12,13,14,15])
for i in x:
    if 100 in x:
        print('yes, 100 is found in x')
    else:
        print('not found')
        break

not found

In [ ]:
For the given series A and B, perform concatenation on the same.
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])

In [89]:
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])
concat=pd.concat([series_A,series_B])
concat

0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
dtype: int64

In [ ]:
Using loops in python, print all the elements within a pandas series.
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [92]:
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])
for i in Sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

In [ ]:
For a given nested list and a sample dictionary, create two data frames using pandas.
List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [93]:
List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [98]:
List=pd.DataFrame(List)
print(List)
print('')
Dict=pd.DataFrame(Dictionary)
print(Dict)

    0   1   2
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

In [ ]:
Create a pandas Dataframe with two columns = [Name, Age]. Perform the following
operations on the same.
a. Print the first 3 rows of the Data Frame .
b. Print the rows that have the age greater than 15.
c. Insert 5 imaginary names and ages as values to the pandas Data Frame .
d. Update the 5th row so that the name = john and age=56.
e. Delete the first row from the Data Frame .

In [135]:
Info=pd.DataFrame({'Name':['Mehnaz','Alqama','Priya','Sam','Rohit','Sumaiya'],'Age':[23,25,21,26,12,18]})

In [138]:
Info
print(Info.loc[:2,:])
print('')
print(Info.loc[Info['Age']>15])
print('')
Info.loc[6]=['priya',22]
Info

     Name  Age
0  Mehnaz   23
1  Alqama   25
2   Priya   21

      Name  Age
0   Mehnaz   23
1   Alqama   25
2    Priya   21
3      Sam   26
5  Sumaiya   18
6    priya   22

      Name  Age
0   Mehnaz   23
1   Alqama   25
2    Priya   21
3      Sam   26
4    Rohit   12
5  Sumaiya   18
6    priya   22

In [139]:
Info.drop(0)

      Name  Age
1   Alqama   25
2    Priya   21
3      Sam   26
4    Rohit   12
5  Sumaiya   18
6    priya   22

In [141]:
Info.reset_index(drop=True)

      Name  Age
0   Mehnaz   23
1   Alqama   25
2    Priya   21
3      Sam   26
4    Rohit   12
5  Sumaiya   18
6    priya   22

In [145]:
LL=list(Info)
LL
DD=dict(Info)
DD

{'Name': 0     Mehnaz
 1     Alqama
 2      Priya
 3        Sam
 4      Rohit
 5    Sumaiya
 6      priya
 Name: Name, dtype: object,
 'Age': 0    23
 1    25
 2    21
 3    26
 4    12
 5    18
 6    22
 Name: Age, dtype: int64}

In [151]:

series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])
c=pd.concat([series_A,series_B],ignore_index=True)
c

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64